{
    "Afrikaans": "Afrikaans is a language derived from Dutch and is spoken mainly in South Africa and Namibia.",
    "Albanian": "The Albanian language is unique among European languages because it belongs to its own language family, unrelated to any other major language.",
    "Amharic": "Amharic is the official language of Ethiopia and has its own unique script with 33 basic characters.",
    "Arabic": "The word \"Arabic\" comes from the Arabic word \"ʿarabiyy\" which means \"Arabian.\" It's the fifth most spoken language in the world.",
    "Armenian": "The Armenian alphabet was invented by Mesrop Mashtots in 405 AD, making it one of the oldest alphabets still in use.",
    "Azerbaijani": "Azerbaijani is the official language of Azerbaijan and is closely related to Turkish and other Turkic languages.",
    "Basque": "Basque is a language isolate, meaning it has no known linguistic relatives. It's spoken in the Basque Country, spanning parts of Spain and France.",
    "Belarusian": "The Belarusian language uses both the Cyrillic and Latin scripts. It's spoken mainly in Belarus and parts of Poland and Lithuania.",
    "Bengali": "Bengali is the seventh most spoken language in the world and is known for its rich literary history, including the works of Rabindranath Tagore.",
    "Bosnian": "Bosnian is one of the official languages of Bosnia and Herzegovina and is written in both the Latin and Cyrillic scripts.",
    "Bulgarian": "Bulgarian is the oldest written Slavic language and has a complex verb system that includes three grammatical genders.",
    "Catalan": "Catalan is spoken in Catalonia, Spain, and parts of France. It has a strong literary tradition and a history of cultural identity.",
    "Cebuano": "Cebuano is an Austronesian language spoken in the Philippines and is one of the most widely spoken languages in the country.",
    "Chichewa": "Chichewa is spoken in Malawi and parts of Zambia, Mozambique, and Zimbabwe. It's known for its simple and regular grammar.",
    "Chinese (simplified)": "Chinese characters are logograms, where each character represents a morpheme or word, making written communication possible across dialects.",
    "Chinese (traditional)": "Chinese characters are logograms, where each character represents a morpheme or word, making written communication possible across dialects.",
    "Corsican": "Corsican is a Romance language spoken on the island of Corsica, and it has been influenced by both Italian and French.",
    "Croatian": "The Croatian language is mutually intelligible with Serbian and Bosnian, but it's written in the Latin script.",
    "Czech": "The Czech language has a rich literary history, with famous authors like Franz Kafka and Milan Kundera hailing from Czech-speaking regions.",
    "Danish": "Danish is known for its unique phonetic features and is spoken in Denmark and parts of Greenland.",
    "Dutch": "Dutch is the official language of the Netherlands and is also spoken in Belgium and Suriname. It's closely related to German and English.",
    "English": "English is the third most spoken language in the world and is known for its extensive vocabulary, largely influenced by Latin, Germanic languages, and more.",
    "Esperanto": "Esperanto is a constructed international auxiliary language created in the late 19th century to foster communication between people of different native languages.",
    "Estonian": "Estonian is closely related to Finnish and is spoken in Estonia. It's known for its intricate system of 14 noun cases.",
    "Filipino": "Filipino is the standardized version of Tagalog and is one of the official languages of the Philippines. It's based on Tagalog but includes loanwords from other languages.",
    "Finnish": "Finnish is known for its complex grammar and vowel harmony. It's the official language of Finland and spoken by the majority of the population.",
    "French": "French is often referred to as the \"language of love\" and is known for its influence on diplomacy, literature, and cuisine.",
    "Frisian": "Frisian is spoken in parts of the Netherlands and Germany. It has three main dialects and is recognized as an official regional language in the Netherlands.",
    "Galician": "Galician is spoken in the region of Galicia in Spain and shares linguistic similarities with Portuguese. It has a rich poetic tradition.",
    "Georgian": "The Georgian alphabet is one of the only three original scripts still in use in the modern world. The language has a unique grammatical structure.",
    "German": "German is known for its compound words and complex sentence structure. It's the most widely spoken native language in the European Union.",
    "Greek": "The Greek language has been spoken for over 3,000 years, making it one of the oldest recorded languages in the world.",
    "Gujarati": "Gujarati is spoken in the Indian state of Gujarat and is known for its rich literary heritage and contribution to Mahatma Gandhi's writings.",
    "Haitian creole": "Haitian Creole is a creole language that developed from interactions between French colonists, African slaves, and indigenous peoples in Haiti.",
    "Hausa": "Hausa is spoken in West Africa and is one of the most widely spoken languages in the region. It's used in trade and communication across different ethnic groups.",
    "Hawaiian": "Hawaiian is an Austronesian language spoken in Hawaii. It has a small number of native speakers, but efforts are being made to revitalize it.",
    "Hebrew": "Hebrew is an ancient Semitic language that was revived as a spoken language in the late 19th century, making it a unique case of language revitalization.",
    "Hindi": "Hindi is one of the most widely spoken languages in India and is written in the Devanagari script. It's known for its cultural influence and Bollywood films.",
    "Hmong": "Hmong is spoken by the Hmong people, who live in various regions of Asia. It has a complex system of tones that can change the meaning of words.",
    "Hungarian": "Hungarian is a Finno-Ugric language, making it quite distinct from other languages in Europe. It has a complex case system and agglutinative grammar.",
    "Icelandic": "Icelandic is spoken in Iceland and has preserved many archaic features of Old Norse, making it relatively unchanged over centuries.",
    "Igbo": "Igbo is spoken in Nigeria and is known for its musical and artistic traditions. Chinua Achebe's novel \"Things Fall Apart\" is written in Igbo.",
    "Indonesian": "Indonesian, also known as Bahasa Indonesia, is a standardized version of Malay and is the official language of Indonesia.",
    "Irish": "Irish, also known as Irish Gaelic, is one of the official languages of Ireland. It has a rich literary history and a system of initial mutations.",
    "Italian": "Italian is the language of art, culture, and music. It has many dialects, but the standard version is based on the Tuscan dialect.",
    "Japanese": "Japanese is known for its writing system that includes kanji characters borrowed from Chinese, as well as two native scripts, hiragana and katakana.",
    "Javanese": "Javanese is spoken on the Indonesian island of Java and has a complex system of politeness levels in its grammar.",
    "Kannada": "Kannada is spoken in the Indian state of Karnataka and has a long literary tradition dating back to ancient times.",
    "Kazakh": "Kazakh is spoken in Kazakhstan and other Central Asian countries. It uses the Cyrillic script and has vowel harmony.",
    "Khmer": "Khmer is the official language of Cambodia and has one of the most extensive alphabets in the world, with 74 characters.",
    "Korean": "Korean has an elaborate honorifics system, indicating differences in politeness and formality. It's written in the Hangul script.",
    "Kurdish (kurmanji)": "Kurdish (Kurmanji) is spoken by the Kurdish people across parts of Turkey, Iraq, Iran, and Syria. It uses the Latin script.",
    "Kyrgyz": "Kyrgyz is spoken in Kyrgyzstan and uses the Cyrillic script. It's known for its oral epic poetry tradition, known as Manas.",
    "Lao": "Lao is the official language of Laos and is closely related to Thai. It has its own script and a long literary history.",
    "Latin": "Latin was the language of the ancient Romans and served as the basis for many modern European languages.",
    "Latvian": "Latvian is spoken in Latvia and uses the Latin script. It has a relatively large number of diacritics compared to other European languages.",
    "Lithuanian": "Lithuanian is one of the oldest Indo-European languages still spoken today. It's known for its archaic features and conservative grammar.",
    "Luxembourgish": "Luxembourgish is spoken in Luxembourg and is closely related to German. It's one of the official languages of the country.",
    "Macedonian": "Macedonian is spoken in North Macedonia and uses the Cyrillic script. It has a distinct grammar and vocabulary within the Slavic language family.",
    "Malagasy": "Malagasy is spoken in Madagascar and is unique among African languages because it's of Austronesian origin rather than Bantu.",
    "Malay": "Malay is spoken in various countries across Southeast Asia and is the official language of Malaysia and Brunei.",
    "Malayalam": "Malayalam is spoken in the Indian state of Kerala and has a script with its own characters. It's known for its rich literary heritage.",
    "Maltese": "Maltese is the only Semitic language written in the Latin script. It's the official language of Malta and has Arabic and Romance influences.",
    "Maori": "Māori is an official language of New Zealand and is spoken by the Māori people. It has a rich cultural heritage and a strong presence in arts.",
    "Marathi": "Marathi is spoken in the Indian state of Maharashtra and has a rich literary tradition that includes the works of saint-poet Tukaram.",
    "Mongolian": "Mongolian is spoken in Mongolia and parts of China. It has a unique script that was designed to represent the sounds of the language.",
    "Myanmar (Burmese)": "Burmese is the official language of Myanmar and is written in the Burmese script. It has its own distinct writing style.",
    "Nepali": "Nepali is the official language of Nepal and is written in the Devanagari script. It's closely related to Hindi and other Indo-Aryan languages.",
    "Norwegian": "Norwegian has two written forms, Bokmål and Nynorsk, which reflect different dialects and historical influences.",
    "Odia": "Odia is spoken in the Indian state of Odisha and has a rich literary heritage. It's written in the Odia script.",
    "Pashto": "Pashto is spoken by the Pashtun people in Afghanistan and Pakistan. It's written in both the Arabic and Latin scripts.",
    "Persian": "Persian, also known as Farsi, has a long literary history and has contributed to world literature through poets like Rumi and Hafez.",
    "Polish": "Polish is the official language of Poland and is known for its complex grammar, including cases and verb conjugations.",
    "Portuguese": "Portuguese is spoken in Portugal, Brazil, and several other countries. It's one of the most spoken languages in the world.",
    "Punjabi": "Punjabi is spoken in Punjab, India, and Punjab, Pakistan. It has a rich cultural and musical tradition.",
    "Romanian": "Romanian is a Romance language spoken in Romania and Moldova. It has preserved many Latin features and has Slavic influences.",
    "Russian": "Russian is the most widely spoken language in Russia and one of the six official languages of the United Nations.",
    "Samoan": "Samoan is spoken in Samoa and American Samoa. It's known for its relatively simple grammar and strong oral tradition.",
    "Scots Gaelic": "Scottish Gaelic is spoken in Scotland and has a Celtic origin. It's related to Irish and Manx Gaelic.",
    "Serbian": "Serbian is spoken in Serbia and other countries in the Balkans. It's written in both the Cyrillic and Latin scripts.",
    "Sesotho": "Sesotho is spoken in Lesotho and parts of South Africa. It's one of the official languages of Lesotho.",
    "Shona": "Shona is spoken in Zimbabwe and neighboring countries. It's known for its musical and storytelling traditions.",
    "Sindhi": "Sindhi is spoken in the Sindh region of Pakistan and parts of India. It uses both the Arabic and Devanagari scripts.",
    "Sinhala": "Sinhala is spoken in Sri Lanka and has its own script. It has a rich literary history, including ancient Buddhist texts.",
    "Slovak": "Slovak is spoken in Slovakia and is closely related to Czech. It's written in the Latin script.",
    "Slovenian": "Slovenian is spoken in Slovenia and has a unique dual grammatical number that indicates pairs or groups.",
    "Somali": "Somali is spoken in Somalia and other parts of the Horn of Africa. It's written in both the Latin and Arabic scripts.",
    "Spanish": "Spanish is one of the most spoken languages globally and has a rich literary heritage, including works by authors like Cervantes.",
    "Sundanese": "Sundanese is spoken in West Java, Indonesia. It's known for its script, which is used for both Sundanese and Old Javanese languages.",
    "Swahili": "Swahili is a widely spoken language in East Africa and is known for its role as a lingua franca in the region.",
    "Swedish": "Swedish is spoken in Sweden and parts of Finland. It's known for its vowel-heavy words and its contributions to literature.",
    "Tajik": "Tajik is spoken in Tajikistan and is closely related to Persian. It uses the Cyrillic script.",
    "Tamil": "Tamil is spoken in Tamil Nadu, India, and Sri Lanka. It's one of the classical languages of India with a rich literary tradition.",
    "Telugu": "Telugu is spoken in the Indian states of Andhra Pradesh and Telangana. It has a script of its own and is known for its poetry.",
    "Thai": "Thai is the official language of Thailand and has a unique script with its own characters. It's tonal and has complex politeness levels.",
    "Turkish": "Turkish is known for its agglutinative grammar and has undergone significant language reforms to adopt a Latin-based script.",
    "Ukrainian": "Ukrainian is spoken in Ukraine and uses the Cyrillic script. It's closely related to Russian and Belarusian.",
    "Urdu": "Urdu is one of the official languages of Pakistan and is written in the Perso-Arabic script. It's known for its poetic tradition.",
    "Uyghur": "Uyghur is spoken by the Uyghur people in Xinjiang, China. It uses the Uyghur Arabic script and is a Turkic language.",
    "Uzbek": "Uzbek is spoken in Uzbekistan and other Central Asian countries. It uses the Cyrillic script and has dialectal variations.",
    "Vietnamese": "Vietnamese is tonal and uses the Latin script, heavily influenced by French colonial rule. It's the official language of Vietnam.",
    "Welsh": "Welsh is spoken in Wales and is one of the oldest living Celtic languages. Efforts have been made to revitalize it.",
    "Xhosa": "Xhosa is spoken in South Africa and has distinctive click consonants. It's known for its oral storytelling traditions.",
    "Yiddish": "Yiddish is spoken by Ashkenazi Jews and has Germanic roots with Hebrew and Slavic loanwords.",
    "Yoruba": "Yoruba is spoken in West Africa, primarily in Nigeria. It's tonal and has a rich tradition of folklore and religion.",
    "Zulu": "Zulu is spoken in South Africa and has a large number of speakers. It's known for its complex noun class system."
}
